yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_controller.c
/* ==========================================================================
 * PROJECT: Adaptive Robotized Manual Transmission Controller
 * MCU: STM32F103C8T6 (72 MHz, 64KB Flash, 20KB RAM)
 * VERSION: 4.0 FINAL (Competition / Production Edition)
 * AUTHOR: Mykola Yushchenko
 * LICENSE: GPL-3.0
 * ========================================================================== */

#include "main.h"
#include "stm32f1xx_hal.h"
#include <stdbool.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <math.h>

/* ==================== 1. MEMORY ADDRESSES ==================== */
#define CALIB_FLASH_ADDR        0x0800FC00
#define CAN_PROFILE_FLASH_ADDR  0x0800F800
#define ERROR_LOG_ADDR          0x0800F000

/* ==================== 2. SYSTEM CONSTANTS ==================== */
#define CALIB_MAGIC             0xA5C3F0F0
#define ERROR_LOG_MAX_ENTRIES   50
#define IDLE_TIMEOUT_MS         5000
#define SENSOR_TOLERANCE        100
#define FILTER_ALPHA            0.2f
#define MAX_CALIB_STEPS         5000
#define BACKOFF_STEPS           50
#define CLUTCH_TIMEOUT_MS       5000
#define UART_MSG_BUF_SIZE       64

#define COOLANT_TEMP_ADC_CH     ADC_CHANNEL_8
#define IGNITION_PIN            GPIO_PIN_9

#define COLD_ENGINE_RPM_LIMIT   4000
#define NORMAL_ENGINE_RPM_LIMIT 7000
#define SPORT_RPM_LIMIT         7200

#define CASCADE_DELAY_COMFORT   600
#define CASCADE_DELAY_NORMAL    500
#define CASCADE_DELAY_SPORT     400
#define CASCADE_DELAY_WINTER    800

/* ==================== 3. DATA STRUCTURES ==================== */
typedef struct {
    uint16_t angle_disengaged;
    uint16_t angle_engaged;
    uint16_t angle_bite_point;
    uint8_t  calibrated;
} ClutchCalibration;

typedef struct {
    int32_t left_limit;
    int32_t right_limit;
    int32_t home_offset;
    int32_t backlash;
    uint8_t calibrated;
} AxisCalibration;

typedef struct __attribute__((packed)) {
    uint32_t magic;
    uint16_t crc;
    uint8_t  version;
    uint16_t clutch_disengaged;
    uint16_t clutch_engaged;
    uint16_t clutch_bite;
    int32_t  x_left_limit;
    int32_t  x_right_limit;
    int32_t  x_home;
    int32_t  x_backlash;
    int32_t  y_front_limit;
    int32_t  y_back_limit;
    int32_t  y_home;
    int32_t  y_backlash;
    int32_t  gear_positions[7][2];
    uint8_t  calibrated;
} CalibrationData;

typedef struct {
    uint16_t raw_min;
    uint16_t raw_max;
    float scale;
    uint8_t calibrated;
} BackupSensorCalibration;

typedef struct {
    uint16_t rpm_id; uint8_t rpm_offset; uint8_t rpm_length; uint8_t rpm_factor; uint8_t rpm_big_endian;
    uint16_t speed_id; uint8_t speed_offset; uint8_t speed_length; uint8_t speed_factor; uint8_t speed_big_endian;
    uint16_t throttle_id; uint8_t throttle_offset; uint8_t throttle_length; uint8_t throttle_factor;
    uint16_t brake_id; uint8_t brake_offset; uint8_t brake_bit;
    uint16_t front_speed_id; uint8_t front_speed_offset; uint8_t front_speed_length;
    uint16_t rear_speed_id; uint8_t rear_speed_offset; uint8_t rear_speed_length;
} CanProfile;

typedef struct {
    uint32_t timestamp;
    uint8_t  error_code;
    uint8_t  severity;
    uint16_t data;
} ErrorLogEntry;

typedef struct {
    uint8_t throttle;
    uint16_t upshift_rpm;
    uint16_t downshift_rpm;
} ShiftMapEntry;

typedef struct {
    uint8_t clutch_disengage_speed;
    uint8_t clutch_engage_speed;
    uint16_t clutch_hold_time_ms;
    uint16_t shift_delay_us;
    uint8_t use_bite_point;
    uint8_t throttle_blip;
    uint16_t max_rpm_shift;
    uint8_t start_from_second;
} DriveParameters;

typedef struct {
    uint8_t awd_enable_pin;
    uint8_t awd_pwm_channel;
    uint16_t awd_engage_delay_ms;
    uint16_t awd_max_temp;
    uint8_t awd_auto_speed_diff;
    uint8_t awd_lock_timeout_s;
} AwdConfig;

/* ==================== 4. ENUMERATIONS ==================== */
typedef enum { CAL_STATE_IDLE=0, CAL_STATE_CLUTCH, CAL_STATE_AXIS_X, CAL_STATE_AXIS_Y, CAL_STATE_BACKLASH, CAL_STATE_GEAR_POSITIONS, CAL_STATE_SAVE, CAL_STATE_DONE, CAL_STATE_ERROR } CalibrationState;
typedef enum { CLUTCH_DISENGAGE, CLUTCH_ENGAGE, CLUTCH_TO_BITE } ClutchAction;
typedef enum { PRIMARY_AS5600, BACKUP_POTENTIOMETER, SENSOR_FAULT } ActiveClutchSensor;
typedef enum { DRIVE_MODE_COMFORT=0, DRIVE_MODE_NORMAL=1, DRIVE_MODE_SPORT=2, DRIVE_MODE_WINTER=3 } DriveMode;
typedef enum { AWD_MODE_2WD=0, AWD_MODE_AUTO=1, AWD_MODE_LOCK=2, AWD_MODE_LOW=3 } AwdMode;

/* ==================== 5. ERROR CODES ==================== */
#define ERR_NONE 0, ERR_CURRENT_OVER_X 1, ERR_CURRENT_OVER_Y 2, ERR_CURRENT_OVER_CLUTCH 3, ERR_LIMIT_SWITCH_STUCK 4, ERR_STEPPER_STALL 5, ERR_CLUTCH_TIMEOUT 6, ERR_AS5600_MISSING 7, ERR_GEAR_NOT_FOUND 8, ERR_SHIFT_TIMEOUT 9, ERR_WATCHDOG_RESET 10, ERR_EMERGENCY_BUTTON 11

/* ==================== 6. GLOBAL VARIABLES ==================== */
I2C_HandleTypeDef hi2c1; SPI_HandleTypeDef hspi2; UART_HandleTypeDef huart1, huart3;
CAN_HandleTypeDef hcan1; ADC_HandleTypeDef hadc1; TIM_HandleTypeDef htim2, htim4; IWDG_HandleTypeDef hiwdg;

CalibrationData cal_data = {0}; ClutchCalibration clutch_cal = {0};
AxisCalibration cal_X = {0}, cal_Y = {0}; BackupSensorCalibration backup_cal = {0}; CanProfile current_profile = {0};

volatile uint8_t current_gear = 0, current_shift_target_gear = 0, shifting_in_progress = 0;
volatile DriveMode current_drive_mode = DRIVE_MODE_NORMAL;
volatile CalibrationState cal_state = CAL_STATE_IDLE;
volatile uint8_t calibration_running = 0, calibration_error = 0, calibration_success = 0, cal_in_progress = 0, abort_calibration = 0;
volatile uint8_t system_sleeping = 0, limp_mode_active = 0, is_parked = 0;
volatile uint32_t can_loss_timer = 0, engine_off_timer = 0;
volatile bool as5600_comm_ok = false;

volatile uint8_t ignition_on = 0;
volatile uint16_t coolant_temp_raw = 0;
volatile uint8_t coolant_temp_celsius = 20;
volatile uint16_t engine_rpm_limit = 7000;

