yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_controller.c
volatile uint8_t speed_limiter_enabled = 0;
volatile uint16_t speed_limit_kmh = 50;
volatile uint8_t speed_limit_mph_mode = 0;
volatile uint8_t cruise_control_active = 0;
volatile uint16_t cruise_target_speed = 0;

int32_t current_x_steps = 0, current_y_steps = 0;

volatile uint16_t engine_rpm = 0;
volatile uint8_t vehicle_speed_kmh = 0, throttle_percent = 0, brake_pressed = 0;
volatile uint8_t shift_paddle_up = 0, shift_paddle_down = 0;
uint8_t can_profile_valid = 0;

uint16_t filtered_rpm = 0;
uint8_t filtered_throttle = 0;

volatile uint8_t limit_x_left_triggered = 0, limit_x_right_triggered = 0;
volatile uint8_t limit_y_front_triggered = 0, limit_y_back_triggered = 0;
volatile uint8_t clutch_endstop_triggered = 0;

uint16_t clutch_raw_angle = 0;
volatile uint16_t clutch_backup_sensor_raw = 0;
volatile ActiveClutchSensor active_sensor = PRIMARY_AS5600;
volatile uint8_t as5600_fault = 0;

ErrorLogEntry error_buffer[ERROR_LOG_MAX_ENTRIES];
uint8_t error_index = 0, error_count = 0;

volatile uint32_t last_activity_time = 0, auto_calib_timer = 0;

volatile AwdMode current_awd_mode = AWD_MODE_2WD;
volatile uint8_t awd_engaged = 0;
volatile uint32_t awd_engagement_time = 0;
AwdConfig awd_config = { .awd_enable_pin = GPIO_PIN_4, .awd_engage_delay_ms = 200, .awd_auto_speed_diff = 10, .awd_lock_timeout_s = 30 };

volatile uint16_t front_wheel_speed_raw = 0, rear_wheel_speed_raw = 0;

/* Shift Maps */
static const ShiftMapEntry shift_map_comfort[] = { {0,3500,1100}, {20,3800,1200}, {40,4200,1400}, {60,4800,1700}, {80,5200,2000}, {100,5800,2400} };
static const ShiftMapEntry shift_map_normal[]  = { {0,4000,1400}, {20,4500,1700}, {40,5000,2100}, {60,5500,2600}, {80,6000,3200}, {100,6500,3800} };
static const ShiftMapEntry shift_map_sport[]   = { {0,4500,1800}, {20,5000,2000}, {40,5500,2300}, {60,6000,2600}, {80,6500,3000}, {100,7000,3400} };
static const ShiftMapEntry shift_map_winter[]  = { {0,1800,900},  {20,2000,1000}, {40,2400,1200}, {60,2800,1400}, {80,3000,1600}, {100,3200,1800} };

const DriveParameters params_table[4] = {
    [DRIVE_MODE_COMFORT] = {60, 30, 200, 800, 1, 0, 7000, 0},
    [DRIVE_MODE_NORMAL]  = {80, 50, 120, 500, 1, 0, 7000, 0},
    [DRIVE_MODE_SPORT]   = {100, 80, 50, 300, 1, 0, 7500, 0},
    [DRIVE_MODE_WINTER]  = {70, 35, 300, 700, 1, 0, 6500, 1}
};

const CanProfile known_profiles[] = {
    {0x0C,0,2,4,1, 0x0D,0,1,1,1, 0x11,0,1,1, 0x1A,0,0, 0,0,0, 0,0,0},
    {0x280,2,2,4,1, 0x2A0,2,2,100,1, 0x2A0,0,1,1, 0x2A0,3,0, 0,0,0, 0,0,0},
    {0x2C0,0,2,4,1, 0x2C0,2,1,1,1, 0x2C0,3,1,1, 0x2C0,4,0, 0,0,0, 0,0,0},
    {0x0A0,0,2,4,1, 0x0A0,2,1,1,1, 0x0A0,3,1,1, 0x0A0,4,0, 0,0,0, 0,0,0}
};
#define NUM_PROFILES 4

int16_t current_offsets[3] = {0};

#define BT_BUF_SIZE 32
char bt_buffer[BT_BUF_SIZE];
volatile uint8_t bt_index = 0, bt_cmd_ready = 0;

#define UART_BUF_SIZE 32
char uart_rx_buf[UART_BUF_SIZE];
volatile uint8_t uart_rx_index = 0, uart_cmd_ready = 0;

const char* gear_names[] = { "N", "1", "2", "3", "4", "5", "R" };

volatile uint16_t engine_rpm_analog = 0;
static volatile uint32_t tacho_period_us = 0, tacho_last_capture = 0;

/* ==================== 7. FUNCTION PROTOTYPES ==================== */
void SystemClock_Config(void); void Error_Handler(void); static void DWT_Init(void); static void sleep_us(uint32_t us);
static void MX_GPIO_Init(void); static void MX_I2C1_Init(void); static void MX_SPI2_Init(void);
static void MX_USART1_UART_Init(void); static void MX_USART3_UART_Init(void); static void MX_CAN1_Init(void);
static void MX_ADC1_Init(void); static void MX_TIM2_Init(void); static void MX_TIM4_Init(void);
void IWDG_Init(void); void IWDG_Refresh(void);

void stepper_enable_x(void); void stepper_disable_x(void); void stepper_enable_y(void); void stepper_disable_y(void);
void stepper_set_direction_x(uint8_t dir); void stepper_set_direction_y(uint8_t dir);
void stepper_step_x(void); void stepper_step_y(void);
void stepper_move_x(uint32_t steps, uint32_t delay_us); void stepper_move_y(uint32_t steps, uint32_t delay_us);
void axis_move_relative(uint8_t axis, int32_t steps, uint32_t step_delay_us);

uint16_t AS5600_ReadAngle(void); uint8_t AS5600_Init(void);
void clutch_set_direction(uint8_t dir); void clutch_set_speed(uint8_t duty); void clutch_stop(void);
uint8_t clutch_is_endstop_triggered(void); uint16_t clutch_find_disengaged(void);
uint16_t clutch_find_bite_point(uint16_t dis, uint16_t eng); uint8_t clutch_calibrate(void);
uint16_t clutch_get_disengaged_angle(void); uint16_t clutch_get_engaged_angle(void);
uint16_t clutch_get_bite_point(void); uint16_t clutch_get_current_angle(void);
void clutch_control_advanced(ClutchAction action);

void read_clutch_backup_sensor(void);
void calibrate_backup_sensor(uint16_t raw_dis, uint16_t raw_eng, uint16_t angle_dis, uint16_t angle_eng);
uint16_t backup_to_as5600_angle(uint16_t raw); void check_sensor_consistency(void);

uint8_t axis_calibrate_x(void); uint8_t axis_calibrate_y(void); void run_full_calibration(void); void learn_gear_positions(void);
uint8_t flash_save_calibration(CalibrationData* data); uint8_t flash_load_calibration(CalibrationData* data);
static void flash_unlock(void); static void flash_lock(void); static void flash_erase_page(uint32_t addr);
static uint16_t calculate_crc16(uint8_t* data, uint32_t len);

uint8_t is_shift_safe_winter(uint8_t from, uint8_t to);
void move_to_neutral(void); void move_to_gear_position_advanced(uint8_t gear, uint8_t axis);
uint8_t shift_gear_advanced(uint8_t target); uint8_t shift_gear_limp_safe(uint8_t target);
uint16_t get_adaptive_downshift_hold_time(uint8_t from, uint8_t to);

uint16_t get_rpm_universal(void); uint8_t get_speed_universal(void); void filter_data(void);
void auto_shift_task(void); void manual_shift_task(void);
uint8_t auto_scan_can(void); void save_can_profile(void); void load_can_profile(void); void apply_vehicle_adaptation(void);

void safety_init(void); void emergency_power_off(void); void emergency_power_on(void); void emergency_stop(void);
void current_monitor_task(void); uint8_t diagnostic_check(void);
void log_error(uint8_t code, uint8_t severity, uint16_t data); void save_error_log_to_flash(void);
float get_current(uint8_t motor_idx); void calibrate_current_offsets(void); void check_critical_failures(void);
void enter_limp_mode(const char* reason); void exit_limp_mode(void);

void activity_reset_timer(void); void idle_monitor_task(void); void power_clutch_off(void); void power_clutch_on(void);
DriveParameters get_current_drive_params(void); void set_drive_mode(DriveMode mode);
void set_drive_mode_by_name(const char* mode_str); uint8_t get_start_gear(void); void start_moving(void);
void execute_parking_mode(void); void exit_parking_mode(void); void parking_monitor_task(void);

void awd_init(void); void awd_set_engaged(uint8_t engage); uint8_t get_wheel_speed_diff(void);
void awd_auto_task(void); void awd_set_mode(AwdMode mode);

void uart_send_string(char* str); void uart_clear_buffer(void); void uart_command_handler(char* cmd);
void bt_send_string(char* str); void send_status_via_bt(void); void process_bt_command(void);
void visualize_axes(void);

void led_set_pattern(uint8_t pattern); void main_loop(void);

void read_coolant_temperature(void); void update_engine_rpm_limit(void); void handle_speed_limiter(void);
void handle_cruise_control(void); void process_ignition_key(void); void cascade_zero_throttle_downshift(void);

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin);
void HAL_CAN_RxFifo0MsgPendingCallback(CAN_HandleTypeDef* hcan);
void USART1_IRQHandler(void); void USART3_IRQHandler(void);
void TIM4_IRQHandler(void); void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef* htim);

