yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_controller.c
static void MX_TIM2_Init(void) {
    htim2.Instance = TIM2;
    htim2.Init.Prescaler = 719; // 72 MHz / 720 = 100 kHz
    htim2.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim2.Init.Period = 999;    // 100 kHz / 1000 = 100 Hz PWM
    htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    htim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;
    if (HAL_TIM_PWM_Init(&htim2) != HAL_OK) Error_Handler();
    
    TIM_MasterConfigTypeDef sMaster = {0};
    sMaster.MasterOutputTrigger = TIM_TRGO_RESET;
    sMaster.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
    HAL_TIMEx_MasterConfigSynchronization(&htim2, &sMaster);
    
    TIM_OC_InitTypeDef sConfigOC = {0};
    sConfigOC.OCMode = TIM_OCMODE_PWM1;
    sConfigOC.Pulse = 0;
    sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
    sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
    HAL_TIM_PWM_ConfigChannel(&htim2, &sConfigOC, TIM_CHANNEL_1);
}

static void MX_TIM4_Init(void) {
    __HAL_RCC_TIM4_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    
    GPIO_InitTypeDef gpio = {0};
    gpio.Pin = GPIO_PIN_6;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOB, &gpio);
    
    htim4.Instance = TIM4;
    htim4.Init.Prescaler = 71; // 72 MHz / 72 = 1 MHz (1 µs resolution)
    htim4.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim4.Init.Period = 0xFFFF;
    htim4.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    htim4.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    if (HAL_TIM_IC_Init(&htim4) != HAL_OK) Error_Handler();
    
    TIM_ClockConfigTypeDef sClock = {0};
    sClock.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
    HAL_TIM_ConfigClockSource(&htim4, &sClock);
    
    TIM_MasterConfigTypeDef sMaster = {0};
    sMaster.MasterOutputTrigger = TIM_TRGO_RESET;
    sMaster.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
    HAL_TIMEx_MasterConfigSynchronization(&htim4, &sMaster);
    
    TIM_IC_InitTypeDef sIC = {0};
    sIC.ICPolarity = TIM_ICPOLARITY_RISING;
    sIC.ICSelection = TIM_ICSELECTION_DIRECTTI;
    sIC.ICPrescaler = TIM_ICPSC_DIV1;
    sIC.ICFilter = 0;
    HAL_TIM_IC_ConfigChannel(&htim4, &sIC, TIM_CHANNEL_1);
    
    HAL_NVIC_SetPriority(TIM4_IRQn, 2, 0);
    HAL_NVIC_EnableIRQ(TIM4_IRQn);
    HAL_TIM_IC_Start_IT(&htim4, TIM_CHANNEL_1);
}

void IWDG_Init(void) {
    hiwdg.Instance = IWDG;
    hiwdg.Init.Prescaler = IWDG_PRESCALER_64;
    hiwdg.Init.Reload = 625; // ~1 second timeout
    HAL_IWDG_Init(&hiwdg);
}

void IWDG_Refresh(void) {
    HAL_IWDG_Refresh(&hiwdg);
}

/* --- Stepper and Clutch Low-Level Control --- */

void stepper_enable_x(void) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_RESET); }
void stepper_disable_x(void) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_SET); }
void stepper_set_direction_x(uint8_t dir) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, dir ? GPIO_PIN_SET : GPIO_PIN_RESET); }
void stepper_step_x(void) {
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_SET);
    sleep_us(5);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_RESET);
    sleep_us(5);
}
void stepper_move_x(uint32_t steps, uint32_t delay_us) {
    if (!steps) return;
    stepper_enable_x();
    for (uint32_t i = 0; i < steps; i++) {
        stepper_step_x();
        current_x_steps += (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_1) == GPIO_PIN_SET) ? 1 : -1;
        if (delay_us) sleep_us(delay_us);
        if ((i & 0xFF) == 0) IWDG_Refresh();
    }
}

void stepper_enable_y(void) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET); }
void stepper_disable_y(void) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_SET); }
void stepper_set_direction_y(uint8_t dir) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, dir ? GPIO_PIN_SET : GPIO_PIN_RESET); }
void stepper_step_y(void) {
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET);
    sleep_us(5);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_RESET);
    sleep_us(5);
}
void stepper_move_y(uint32_t steps, uint32_t delay_us) {
    if (!steps) return;
    stepper_enable_y();
    for (uint32_t i = 0; i < steps; i++) {
        stepper_step_y();
        current_y_steps += (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_4) == GPIO_PIN_SET) ? 1 : -1;
        if (delay_us) sleep_us(delay_us);
        if ((i & 0xFF) == 0) IWDG_Refresh();
    }
}

void clutch_set_direction(uint8_t dir) {
    if (dir == 0) {
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7, GPIO_PIN_SET);
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);
    } else {
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7, GPIO_PIN_RESET);
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);
    }
}

void clutch_set_speed(uint8_t duty) {
    uint32_t pulse = (uint32_t)duty * 10;
    if (pulse > 1000) pulse = 1000;
    __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, pulse);
}

void clutch_stop(void) {
    clutch_set_speed(0);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);
}

uint8_t clutch_is_endstop_triggered(void) {
    return (HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_1) == GPIO_PIN_RESET) ? 1 : 0;
}

uint8_t AS5600_Init(void) {
    uint8_t dummy = 0;
    return (HAL_I2C_Mem_Read(&hi2c1, 0x36 << 1, 0x0B, I2C_MEMADD_SIZE_8BIT, &dummy, 1, 100) == HAL_OK);
}

uint16_t AS5600_ReadAngle(void) {
    uint8_t buf[2];
    if (HAL_I2C_Mem_Read(&hi2c1, 0x36 << 1, 0x0C, I2C_MEMADD_SIZE_8BIT, buf, 2, 100) == HAL_OK) {
        as5600_comm_ok = true;
        clutch_raw_angle = ((uint16_t)buf[0] << 8) | buf[1];
        return clutch_raw_angle;
    }
    as5600_comm_ok = false;
    return 0xFFFF;
}

uint16_t clutch_find_disengaged(void) {
    clutch_set_direction(0);
    clutch_set_speed(30);
    uint32_t timeout = HAL_GetTick() + CLUTCH_TIMEOUT_MS;
    while (!clutch_is_endstop_triggered() && HAL_GetTick() < timeout) {
        HAL_Delay(10);
        IWDG_Refresh();
    }
    clutch_stop();
    return clutch_is_endstop_triggered() ? AS5600_ReadAngle() : 0;
}

uint16_t clutch_find_bite_point(uint16_t dis, uint16_t eng) {
    int32_t range = (int32_t)dis - (int32_t)eng;
    if (range < 0) range = -range;
    return (uint16_t)((float)eng + (float)range * 0.7f);
}

uint8_t clutch_calibrate(void) {
    if (!AS5600_Init()) return 0;
    
    uint16_t dis_angle = clutch_find_disengaged();
    if (dis_angle == 0) return 0;
    
    read_clutch_backup_sensor();
    uint16_t raw_dis = clutch_backup_sensor_raw;
    
    clutch_set_direction(1);
    clutch_set_speed(30);
    uint32_t timeout = HAL_GetTick() + 3000;
    uint16_t last = dis_angle, cur = dis_angle, eng = dis_angle;
    uint8_t stable = 0;
    
    while (HAL_GetTick() < timeout) {
        cur = AS5600_ReadAngle();
        int32_t diff = (int32_t)cur - (int32_t)last;
        if (diff < 0) diff = -diff;
        
        if (diff < 5) {
            if (++stable >= 5) { eng = cur; break; }
        } else {
            stable = 0;
        }
        last = cur;
        HAL_Delay(20);
        IWDG_Refresh();
    }
    clutch_stop();
    
    read_clutch_backup_sensor();
    uint16_t raw_eng = clutch_backup_sensor_raw;
    
    clutch_cal.angle_disengaged = dis_angle;
    clutch_cal.angle_engaged = eng;
    clutch_cal.angle_bite_point = clutch_find_bite_point(dis_angle, eng);
    clutch_cal.calibrated = 1;
    
