yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_controller.c
    calibrate_backup_sensor(raw_dis, raw_eng, dis_angle, eng);
    return 1;
}

uint16_t clutch_get_disengaged_angle(void) { return clutch_cal.angle_disengaged; }
uint16_t clutch_get_engaged_angle(void) { return clutch_cal.angle_engaged; }
uint16_t clutch_get_bite_point(void) { return clutch_cal.angle_bite_point; }

/* ==========================================================================
 * PART 3: AXIS CALIBRATION, FLASH STORAGE, SHIFTING LOGIC & SAFETY
 * ========================================================================== */

/* --- Axis Calibration and Backlash Measurement --- */

static uint8_t axis_find_limit(uint8_t axis, uint8_t dir, uint32_t max_steps, uint32_t d_us, volatile uint8_t* flag) {
    uint32_t steps = 0;
    if (axis == 0) stepper_set_direction_x(dir); 
    else stepper_set_direction_y(dir);
    
    while (*flag == 0 && steps < max_steps && abort_calibration == 0) {
        if (axis == 0) { 
            stepper_step_x(); 
            current_x_steps += (dir == 1) ? 1 : -1; 
        } else { 
            stepper_step_y(); 
            current_y_steps += (dir == 1) ? 1 : -1; 
        }
        steps++; 
        if (d_us) sleep_us(d_us);
        if ((steps & 0xFF) == 0) IWDG_Refresh();
    }
    
    if (*flag == 1 && abort_calibration == 0) {
        uint8_t backoff = (dir == 1) ? 0 : 1;
        if (axis == 0) {
            stepper_set_direction_x(backoff);
            for (int i = 0; i < BACKOFF_STEPS; i++) { 
                stepper_step_x(); 
                current_x_steps += (backoff == 1) ? 1 : -1; 
                sleep_us(d_us); 
            }
        } else {
            stepper_set_direction_y(backoff);
            for (int i = 0; i < BACKOFF_STEPS; i++) { 
                stepper_step_y(); 
                current_y_steps += (backoff == 1) ? 1 : -1; 
                sleep_us(d_us); 
            }
        }
        return 1;
    }
    return 0;
}

static int32_t axis_measure_backlash(uint8_t axis, uint8_t ret_dir, uint32_t d_us) {
    uint32_t away = 200;
    uint8_t away_dir = (ret_dir == 1) ? 0 : 1;
    
    if (axis == 0) { 
        stepper_set_direction_x(away_dir); 
        for (uint32_t i = 0; i < away; i++) { 
            stepper_step_x(); 
            current_x_steps += (away_dir == 1) ? 1 : -1; 
            sleep_us(d_us); 
        } 
    } else { 
        stepper_set_direction_y(away_dir); 
        for (uint32_t i = 0; i < away; i++) { 
            stepper_step_y(); 
            current_y_steps += (away_dir == 1) ? 1 : -1; 
            sleep_us(d_us); 
        } 
    }
    
    if (axis == 0) { 
        if (ret_dir == 0) limit_x_left_triggered = 0; 
        else limit_x_right_triggered = 0; 
    } else { 
        if (ret_dir == 0) limit_y_front_triggered = 0; 
        else limit_y_back_triggered = 0; 
    }
    
    uint32_t back = 0;
    volatile uint8_t* flag = (axis == 0) ? 
        ((ret_dir == 0) ? &limit_x_left_triggered : &limit_x_right_triggered) : 
        ((ret_dir == 0) ? &limit_y_front_triggered : &limit_y_back_triggered);
        
    while (*flag == 0 && back < (away + 100) && abort_calibration == 0) {
        if (axis == 0) { 
            stepper_set_direction_x(ret_dir); 
            stepper_step_x(); 
            current_x_steps += (ret_dir == 1) ? 1 : -1; 
        } else { 
            stepper_set_direction_y(ret_dir); 
            stepper_step_y(); 
            current_y_steps += (ret_dir == 1) ? 1 : -1; 
        }
        back++; 
        sleep_us(d_us);
    }
    
    if (*flag == 1) { 
        int32_t bl = (int32_t)back - (int32_t)away; 
        return (bl < 0) ? 0 : bl; 
    }
    return 0;
}

uint8_t axis_calibrate_x(void) {
    if (cal_in_progress || abort_calibration) return 0;
    cal_in_progress = 1; 
    limit_x_left_triggered = 0; 
    limit_x_right_triggered = 0;
    
    if (!axis_find_limit(0, 0, MAX_CALIB_STEPS, 800, &limit_x_left_triggered)) { 
        cal_in_progress = 0; return 0; 
    }
    cal_X.left_limit = current_x_steps;
    
    if (!axis_find_limit(0, 1, MAX_CALIB_STEPS, 800, &limit_x_right_triggered)) { 
        cal_in_progress = 0; return 0; 
    }
    cal_X.right_limit = current_x_steps;
    
    int32_t total = cal_X.right_limit - cal_X.left_limit; 
    if (total <= 0) { cal_in_progress = 0; return 0; }
    
    cal_X.home_offset = cal_X.left_limit + (total / 2);
    cal_X.backlash = axis_measure_backlash(0, 0, 1000);
    cal_X.calibrated = 1; 
    cal_in_progress = 0; 
    return 1;
}

uint8_t axis_calibrate_y(void) {
    if (cal_in_progress || abort_calibration) return 0;
    cal_in_progress = 1; 
    limit_y_front_triggered = 0; 
    limit_y_back_triggered = 0;
    
    if (!axis_find_limit(1, 0, MAX_CALIB_STEPS, 800, &limit_y_front_triggered)) { 
        cal_in_progress = 0; return 0; 
    }
    cal_Y.left_limit = current_y_steps;
    
    if (!axis_find_limit(1, 1, MAX_CALIB_STEPS, 800, &limit_y_back_triggered)) { 
        cal_in_progress = 0; return 0; 
    }
    cal_Y.right_limit = current_y_steps;
    
    int32_t total = cal_Y.right_limit - cal_Y.left_limit; 
    if (total <= 0) { cal_in_progress = 0; return 0; }
    
    cal_Y.home_offset = cal_Y.left_limit + (total / 2);
    cal_Y.backlash = axis_measure_backlash(1, 0, 1000);
    cal_Y.calibrated = 1; 
    cal_in_progress = 0; 
    return 1;
}

void axis_move_relative(uint8_t axis, int32_t steps, uint32_t d_us) {
    if (steps == 0) return;
    uint8_t dir = (steps > 0) ? 1 : 0;
    uint32_t abs_steps = (steps > 0) ? steps : -steps;
    int32_t expected = (axis == 0) ? current_x_steps : current_y_steps;
    expected += (dir == 1) ? abs_steps : -abs_steps;
    
    if (axis == 0) {
        stepper_set_direction_x(dir); 
        stepper_enable_x();
        for (uint32_t i = 0; i < abs_steps; i++) {
            if ((dir == 1 && limit_x_right_triggered) || (dir == 0 && limit_x_left_triggered)) { 
                uart_send_string("X limit!\r\n"); 
                break; 
            }
            stepper_step_x(); 
            current_x_steps += (dir == 1) ? 1 : -1;
            if (d_us) sleep_us(d_us); 
            if ((i & 0xFF) == 0) IWDG_Refresh();
        }
    } else {
        stepper_set_direction_y(dir); 
        stepper_enable_y();
        for (uint32_t i = 0; i < abs_steps; i++) {
            if ((dir == 1 && limit_y_back_triggered) || (dir == 0 && limit_y_front_triggered)) { 
                uart_send_string("Y limit!\r\n"); 
                break; 
            }
            stepper_step_y(); 
            current_y_steps += (dir == 1) ? 1 : -1;
            if (d_us) sleep_us(d_us); 
            if ((i & 0xFF) == 0) IWDG_Refresh();
        }
    }
    
