yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_controller.c
    int32_t actual = (axis == 0) ? current_x_steps : current_y_steps;
    if (actual != expected) { 
        char m[80]; 
        snprintf(m, sizeof(m), "POS ERROR! Exp %ld got %ld\r\n", (long)expected, (long)actual); 
        uart_send_string(m); 
        log_error(ERR_STEPPER_STALL, 1, (uint16_t)(actual & 0xFFFF)); 
    }
}

/* --- Flash Storage and CRC-16 --- */

static uint16_t calculate_crc16(uint8_t* d, uint32_t len) {
    uint16_t crc = 0xFFFF;
    for (uint32_t i = 0; i < len; i++) {
        crc ^= (uint16_t)d[i];
        for (int j = 0; j < 8; j++) {
            if (crc & 1) crc = (crc >> 1) ^ 0xA001;
            else crc >>= 1;
        }
    }
    return crc;
}

static void flash_unlock(void) { HAL_FLASH_Unlock(); }
static void flash_lock(void) { HAL_FLASH_Lock(); }

static void flash_erase_page(uint32_t addr) {
    if (addr < 0x08000000 || addr > 0x0800FFFF) { 
        uart_send_string("Flash addr out of range!\r\n"); 
        return; 
    }
    FLASH_EraseInitTypeDef e = {0}; 
    uint32_t err;
    e.TypeErase = FLASH_TYPEERASE_PAGES; 
    e.Banks = FLASH_BANK_1; 
    e.PageAddress = addr; 
    e.NbPages = 1;
    HAL_FLASHEx_Erase(&e, &err);
}

uint8_t flash_save_calibration(CalibrationData* data) {
    if ((uint32_t)data + sizeof(CalibrationData) > 0x08010000) return 0;
    uint32_t* src = (uint32_t*)data;
    uint32_t words = sizeof(CalibrationData) / 4;
    uint32_t addr = CALIB_FLASH_ADDR;
    
    flash_unlock(); 
    flash_erase_page(CALIB_FLASH_ADDR);
    for (uint32_t i = 0; i < words; i++) {
        if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, addr, src[i]) != HAL_OK) { 
            flash_lock(); 
            return 0; 
        }
        addr += 4;
    }
    flash_lock(); 
    return 1;
}

uint8_t flash_load_calibration(CalibrationData* data) {
    CalibrationData* flash = (CalibrationData*)CALIB_FLASH_ADDR;
    if (flash->magic != CALIB_MAGIC) return 0;
    
    memcpy(data, flash, sizeof(CalibrationData));
    uint16_t stored = data->crc; 
    data->crc = 0;
    uint16_t calc = calculate_crc16((uint8_t*)data, sizeof(CalibrationData));
    data->crc = stored;
    
    return (stored == calc) && data->calibrated;
}

/* --- LED Patterns and Full Calibration --- */

void led_set_pattern(uint8_t pat) {
    static uint32_t last = 0; 
    static uint8_t cur = 0;
    uint32_t now = HAL_GetTick();
    
    if (pat == 0) { 
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET); 
        cur = 0; 
    } else if (pat == 1) { 
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET); 
        cur = 1; 
    } else {
        if (cur != pat) { 
            cur = pat; 
            last = now; 
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET); 
        }
        uint32_t iv = (pat == 2) ? 1000 : (pat == 3) ? 166 : 500;
        if ((now - last) >= iv) { 
            last = now; 
            HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_13); 
        }
    }
}

void run_full_calibration(void) {
    if (calibration_running) return;
    calibration_running = 1; 
    calibration_error = 0; 
    calibration_success = 0; 
    abort_calibration = 0; 
    cal_state = CAL_STATE_CLUTCH;
    
    while (cal_state != CAL_STATE_DONE && cal_state != CAL_STATE_ERROR && abort_calibration == 0) {
        IWDG_Refresh(); 
        led_set_pattern(4);
        
        switch (cal_state) {
            case CAL_STATE_CLUTCH:
                if (clutch_calibrate()) { 
                    cal_data.clutch_disengaged = clutch_get_disengaged_angle(); 
                    cal_data.clutch_engaged = clutch_get_engaged_angle(); 
                    cal_data.clutch_bite = clutch_get_bite_point(); 
                    cal_state = CAL_STATE_AXIS_X; 
                } else {
                    cal_state = CAL_STATE_ERROR; 
                }
                break;
                
            case CAL_STATE_AXIS_X:
                if (axis_calibrate_x()) { 
                    cal_data.x_left_limit = cal_X.left_limit; 
                    cal_data.x_right_limit = cal_X.right_limit; 
                    cal_data.x_home = cal_X.home_offset;  
                    cal_data.x_backlash = cal_X.backlash; 
                    cal_state = CAL_STATE_AXIS_Y; 
                } else {
                    cal_state = CAL_STATE_ERROR; 
                }
                break;
                
            case CAL_STATE_AXIS_Y:
                if (axis_calibrate_y()) { 
                    cal_data.y_front_limit = cal_Y.left_limit; 
                    cal_data.y_back_limit = cal_Y.right_limit; 
                    cal_data.y_home = cal_Y.home_offset; 
                    cal_data.y_backlash = cal_Y.backlash; 
                    cal_state = CAL_STATE_GEAR_POSITIONS;  
                } else {
                    cal_state = CAL_STATE_ERROR; 
                }
                break;
                
            case CAL_STATE_GEAR_POSITIONS:
                for (int i = 0; i < 7; i++) { 
                    cal_data.gear_positions[i][0] = 0; 
                    cal_data.gear_positions[i][1] = 0; 
                }
                cal_state = CAL_STATE_SAVE; 
                break;
                
            case CAL_STATE_SAVE:
                cal_data.magic = CALIB_MAGIC; 
                cal_data.version = 1; 
                cal_data.calibrated = 0; 
                cal_data.crc = 0;
                cal_data.crc = calculate_crc16((uint8_t*)&cal_data, sizeof(CalibrationData));
                if (flash_save_calibration(&cal_data)) { 
                    cal_state = CAL_STATE_DONE; 
                    calibration_success = 1; 
                } else {
                    cal_state = CAL_STATE_ERROR; 
                }
                break;
                
            default: 
                cal_state = CAL_STATE_ERROR; 
                break;
        }
        HAL_Delay(100);
    }
    
    calibration_running = 0;
    if (cal_state == CAL_STATE_DONE) {
        led_set_pattern(2);
    } else { 
        calibration_error = 1; 
        led_set_pattern(3); 
        stepper_disable_x(); 
        stepper_disable_y(); 
        clutch_stop();  
    }
}

/* --- UART Helpers and Gear Learning --- */

