yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_controller.c
void uart_send_string(char* s) { 
    HAL_UART_Transmit(&huart1, (uint8_t*)s, strlen(s), HAL_MAX_DELAY); 
}

void uart_clear_buffer(void) { 
    uart_rx_index = 0; 
    uart_cmd_ready = 0; 
    memset(uart_rx_buf, 0, UART_BUF_SIZE); 
}

void USART1_IRQHandler(void) {
    if (__HAL_UART_GET_FLAG(&huart1, UART_FLAG_RXNE)) {
        uint8_t ch = huart1.Instance->DR;
        if (ch == '\r' || ch == '\n') { 
            if (uart_rx_index > 0) { 
                uart_rx_buf[uart_rx_index] = '\0'; 
                uart_cmd_ready = 1; 
            } else {
                uart_clear_buffer(); 
            }
        } else { 
            if (uart_rx_index < UART_BUF_SIZE - 1) {
                uart_rx_buf[uart_rx_index++] = (char)ch; 
            } else {
                uart_clear_buffer(); 
            }
        }
        __HAL_UART_CLEAR_FLAG(&huart1, UART_FLAG_RXNE);
    }
}

static void wait_for_enter(const char* p) { 
    uart_send_string((char*)p); 
    uart_clear_buffer(); 
    while (!uart_cmd_ready) { 
        HAL_Delay(50); 
        IWDG_Refresh();  
    } 
    uart_clear_buffer(); 
}

static uint8_t learn_one_gear(uint8_t idx) {
    char buf[UART_MSG_BUF_SIZE];
    const char* name = (idx == 0) ? "Neutral (N)" : (idx == 6) ? "Reverse (R)" : gear_names[idx];
    
    snprintf(buf, sizeof(buf), "\r\n--- TEACHING GEAR: %s ---\r\n", name); 
    uart_send_string(buf);
    wait_for_enter("1. Engine OFF, handbrake ON. Press Enter...");
    
    snprintf(buf, sizeof(buf), "2. Move lever into '%s'.\r\n", name); 
    uart_send_string(buf);
    wait_for_enter("   Press Enter when lever is in position...");
    
    stepper_enable_x(); 
    stepper_enable_y(); 
    HAL_Delay(100);
    
    int32_t x = current_x_steps, y = current_y_steps;
    snprintf(buf, sizeof(buf), "   Recorded: X=%ld Y=%ld\r\n   Save? (y/n): ", x, y); 
    uart_send_string(buf);
    
    uart_clear_buffer(); 
    while (!uart_cmd_ready) { 
        HAL_Delay(50); 
        IWDG_Refresh(); 
    }
    
    char resp = uart_rx_buf[0]; 
    uart_clear_buffer();
    
    if (resp == 'y' || resp == 'Y') { 
        cal_data.gear_positions[idx][0] = x; 
        cal_data.gear_positions[idx][1] = y; 
        uart_send_string("   [OK] Saved.\r\n"); 
        return 1; 
    } else { 
        uart_send_string("   [CANCELLED] Retry.\r\n"); 
        return 0; 
    }
}

void learn_gear_positions(void) {
    uart_send_string("\r\n========================================\r\n  GEAR POSITION LEARNING MODE\r\n========================================\r\n");
    stepper_enable_x(); 
    stepper_enable_y();
    
    for (uint8_t g = 0; g <= 6; g++) {
        while (!learn_one_gear(g)) { 
            uart_send_string("\r\n>>> Retrying...\r\n"); 
            HAL_Delay(1000); 
        }
    }
    
    uart_send_string("\r\nSaving to Flash...\r\n");
    cal_data.magic = CALIB_MAGIC; 
    cal_data.version = 1; 
    cal_data.calibrated = 1; 
    cal_data.crc = 0;
    cal_data.crc = calculate_crc16((uint8_t*)&cal_data, sizeof(CalibrationData));
    
    if (flash_save_calibration(&cal_data)) { 
        uart_send_string("=== SUCCESS! All gears saved. ===\r\n"); 
        led_set_pattern(2); 
    } else { 
        uart_send_string("=== ERROR! Flash write failed. ===\r\n"); 
        led_set_pattern(3); 
    }
    move_to_neutral();
}

/* --- Advanced Shifting Logic (FIXED) --- */

uint16_t get_engine_rpm(void) { return get_rpm_universal(); }
uint8_t get_vehicle_speed(void) { return get_speed_universal(); }

/**
 * @brief Check if the requested shift is safe.
 * FIX: Removed the erroneous (rpm > p.max_rpm_shift) check that blocked upshifts.
 * Now shifts are governed solely by the shift_map, allowing normal operation 
 * up to the engine's natural redline.
 */
uint8_t is_shift_safe_winter(uint8_t from, uint8_t to) {
    uint8_t spd = get_vehicle_speed();
    
    // Reverse gear safety
    if (to == 6 && spd > 5) {
        uart_send_string("Shift blocked: Reverse at speed\r\n");
        return 0;
    }
    
    // Winter mode 1st gear safety
    if (current_drive_mode == DRIVE_MODE_WINTER && to == 1 && spd > 10) {
        uart_send_string("Winter: 1st gear blocked >10km/h\r\n");
        return 0;
    }
    
    return 1;
}

uint16_t get_adaptive_downshift_hold_time(uint8_t from, uint8_t to) {
    DriveParameters p = get_current_drive_params(); 
    uint16_t base = p.clutch_hold_time_ms;
    
    if (from > to && to != 0) { // Downshift detected
        uint16_t r = get_engine_rpm(); 
        if (r > 3000) return base + 150; 
        else if (r > 2000) return base + 100; 
        else return base + 50; 
    }
    return base;
}

void clutch_control_advanced(ClutchAction a) {
    DriveParameters p = get_current_drive_params(); 
    uint32_t start; 
    uint16_t hold = get_adaptive_downshift_hold_time(current_gear, current_shift_target_gear);
    
    switch (a) {
        case CLUTCH_DISENGAGE:
            clutch_set_direction(0); 
            clutch_set_speed(p.clutch_disengage_speed);
            start = HAL_GetTick(); 
            while (!clutch_is_endstop_triggered() && (HAL_GetTick() - start < 1000)) { 
                HAL_Delay(5); 
                IWDG_Refresh(); 
            }
            clutch_stop(); 
            for (uint16_t i = 0; i < hold; i += 50) { 
                HAL_Delay(50); 
                IWDG_Refresh(); 
            } 
            break;
            
        case CLUTCH_ENGAGE:
            clutch_set_direction(1); 
            clutch_set_speed(p.clutch_engage_speed);
            if (!p.use_bite_point) {
                start = HAL_GetTick(); 
                while (clutch_get_current_angle() < cal_data.clutch_engaged && (HAL_GetTick() - start < 1000)) { 
                    HAL_Delay(5); 
                    IWDG_Refresh(); 
                }
            } else {
                // Smooth engagement: pause at bite point
                start = HAL_GetTick(); 
                while (clutch_get_current_angle() < cal_data.clutch_bite && (HAL_GetTick() - start < 1000)) { 
                    HAL_Delay(5); 
                    IWDG_Refresh(); 
                }
                clutch_stop(); 
                HAL_Delay(300);
                clutch_set_direction(1); 
                clutch_set_speed(20);
                start = HAL_GetTick(); 
                while (clutch_get_current_angle() < cal_data.clutch_engaged && (HAL_GetTick() - start < 1000)) { 
                    HAL_Delay(5); 
                    IWDG_Refresh(); 
                }
            }
            clutch_stop(); 
            break;
            
        case CLUTCH_TO_BITE:
            clutch_set_direction(1); 
            clutch_set_speed(p.use_bite_point ? 20 : 60);
            while (clutch_get_current_angle() < cal_data.clutch_bite) { 
                HAL_Delay(5); 
                IWDG_Refresh(); 
            }
            clutch_stop(); 
            break;
    }
}

void move_to_gear_position_advanced(uint8_t gear, uint8_t axis) {
    DriveParameters p = get_current_drive_params(); 
    uint32_t d = p.shift_delay_us;
    int32_t target = (axis == 0) ? cal_data.gear_positions[gear][0] : cal_data.gear_positions[gear][1];
    
