yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_controller.c
    if (target == 0 && gear != 0) { 
        uart_send_string("ERROR: Gear not learned\r\n"); 
        return; 
    }
    
    int32_t cur = (axis == 0) ? current_x_steps : current_y_steps;
    int32_t bl = (axis == 0) ? cal_data.x_backlash : cal_data.y_backlash;
    int32_t diff = target - cur; 
    if (diff == 0) return;
    
    uint8_t dir = (diff > 0) ? 1 : 0; 
    int32_t abs_diff = (diff > 0) ? diff : -diff;
    
    // Backlash compensation logic
    if (axis == 0) {
        if (dir == 1) { 
            if (cur > target) axis_move_relative(0, -(abs_diff + bl), d); 
            axis_move_relative(0, abs_diff + bl, d); 
        } else { 
            if (cur < target) axis_move_relative(0, (abs_diff + bl), d); 
            axis_move_relative(0, -(abs_diff + bl), d); 
        }
    } else {
        if (dir == 1) { 
            if (cur > target) axis_move_relative(1, -(abs_diff + bl), d); 
            axis_move_relative(1, abs_diff + bl, d); 
        } else { 
            if (cur < target) axis_move_relative(1, (abs_diff + bl), d); 
            axis_move_relative(1, -(abs_diff + bl), d); 
        }
    }
}

void move_to_neutral(void) { 
    move_to_gear_position_advanced(0, 1); 
    HAL_Delay(30); 
    move_to_gear_position_advanced(0, 0); 
    HAL_Delay(30); 
}

uint8_t shift_gear_advanced(uint8_t t) {
    if (shifting_in_progress) return 0; 
    if (t == current_gear) return 1; 
    if (!is_shift_safe_winter(current_gear, t)) return 0;
    
    shifting_in_progress = 1; 
    current_shift_target_gear = t; 
    activity_reset_timer();
    
    char msg[64]; 
    snprintf(msg, sizeof(msg), "Shifting to gear %d...\r\n", t); 
    uart_send_string(msg);
    
    clutch_control_advanced(CLUTCH_DISENGAGE);
    
    if (current_gear != 0) { 
        move_to_neutral(); 
        HAL_Delay(50); 
    }
    
    if (t != 0) { 
        move_to_gear_position_advanced(t, 0); 
        HAL_Delay(40); 
        move_to_gear_position_advanced(t, 1); 
        HAL_Delay(80); 
    }
    
    if (t == 0) {
        clutch_control_advanced(CLUTCH_ENGAGE);
    } else {
        if (current_gear == 0 && get_vehicle_speed() < 3) { 
            clutch_control_advanced(CLUTCH_TO_BITE); 
            HAL_Delay(400); 
            clutch_control_advanced(CLUTCH_ENGAGE); 
        } else {
            clutch_control_advanced(CLUTCH_ENGAGE);
        }
    }
    
    current_gear = t; 
    shifting_in_progress = 0; 
    current_shift_target_gear = 0;
    
    snprintf(msg, sizeof(msg), "Shift complete. Gear: %d\r\n", current_gear); 
    uart_send_string(msg);
    return 1;
}

uint8_t shift_gear_limp_safe(uint8_t t) {
    if (!limp_mode_active) return shift_gear_advanced(t);
    
    // In Limp Mode, only Neutral (0) and 2nd gear (2) are allowed
    if (t == 0 || t == 2 || t == current_gear) { 
        uart_send_string("[LIMP] Allowed shift.\r\n"); 
        return shift_gear_advanced(t); 
    }
    
    char msg[128]; 
    snprintf(msg, sizeof(msg), "LIMP: Shift to %d BLOCKED. Use N or 2nd.\r\n", t); 
    uart_send_string(msg); 
    bt_send_string(msg); 
    return 0;
}

/* --- Current Monitoring and Safety --- */

static uint16_t read_adc_channel(uint32_t ch) {
    ADC_ChannelConfTypeDef c = {0}; 
    c.Channel = ch; 
    c.Rank = 1; 
    c.SamplingTime = ADC_SAMPLETIME_13CYCLES_5;
    HAL_ADC_ConfigChannel(&hadc1, &c); 
    HAL_ADC_Start(&hadc1); 
    HAL_ADC_PollForConversion(&hadc1, 10);
    uint16_t val = HAL_ADC_GetValue(&hadc1); 
    HAL_ADC_Stop(&hadc1); 
    return val;
}

void calibrate_current_offsets(void) {
    uint32_t sx = 0, sy = 0, sc = 0;
    for (int i = 0; i < 16; i++) { 
        sx += read_adc_channel(ADC_CHANNEL_10); 
        sy += read_adc_channel(ADC_CHANNEL_11); 
        sc += read_adc_channel(ADC_CHANNEL_12); 
        HAL_Delay(2); 
    }
    current_offsets[0] = sx / 16; 
    current_offsets[1] = sy / 16; 
    current_offsets[2] = sc / 16;
}

float get_current(uint8_t idx) {
    if (idx > 2) return 0.0f;
    uint32_t ch[] = { ADC_CHANNEL_10, ADC_CHANNEL_11, ADC_CHANNEL_12 };
    uint16_t raw = read_adc_channel(ch[idx]); 
    int16_t diff = (int16_t)raw - current_offsets[idx];
    float volts = diff * (3.3f / 4096.0f); 
    float amps = volts / 0.185f; // ACS712-30A: 185 mV/A
    return (amps > 0) ? amps : -amps;
}

void current_monitor_task(void) {
    static uint32_t last = 0; 
    if (HAL_GetTick() - last < 100) return; 
    last = HAL_GetTick();
    
    float ix = get_current(0), iy = get_current(1), ic = get_current(2);
    
    if (ix > 4.5f && !shifting_in_progress && !calibration_running) { 
        log_error(ERR_CURRENT_OVER_X, 1, (uint16_t)(ix * 10)); 
        stepper_disable_x(); 
    }
    if (iy > 4.5f && !shifting_in_progress && !calibration_running) { 
        log_error(ERR_CURRENT_OVER_Y, 1, (uint16_t)(iy * 10)); 
        stepper_disable_y(); 
    }
    if (ic > 10.0f) { 
        log_error(ERR_CURRENT_OVER_CLUTCH, 2, (uint16_t)(ic * 10)); 
        emergency_power_off(); 
    }
}

void emergency_power_off(void) { 
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_RESET); 
    uart_send_string("EMERGENCY POWER OFF\r\n"); 
}

void emergency_power_on(void) { 
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_SET); 
}

void emergency_stop(void) { 
    log_error(ERR_EMERGENCY_BUTTON, 2, 0); 
    emergency_power_off(); 
    shifting_in_progress = 0; 
    calibration_running = 0; 
    limp_mode_active = 1; 
    clutch_stop(); 
    stepper_disable_x(); 
    stepper_disable_y(); 
}

void log_error(uint8_t code, uint8_t sev, uint16_t data) {
    error_buffer[error_index].timestamp = HAL_GetTick(); 
    error_buffer[error_index].error_code = code; 
    error_buffer[error_index].severity = sev; 
    error_buffer[error_index].data = data;
    
    error_index = (error_index + 1) % ERROR_LOG_MAX_ENTRIES; 
    if (error_count < ERROR_LOG_MAX_ENTRIES) error_count++;
    
    if (sev == 2) { 
        limp_mode_active = 1; 
        emergency_power_off(); 
        shifting_in_progress = 0; 
        calibration_running = 0; 
        clutch_stop(); 
        stepper_disable_x(); 
        stepper_disable_y(); 
        led_set_pattern(3); 
        bt_send_string("CRITICAL FAULT! Limp mode.\r\n"); 
    }
}

void save_error_log_to_flash(void) {
    if (error_count == 0) return; 
    flash_unlock(); 
    flash_erase_page(ERROR_LOG_ADDR);
    uint32_t addr = ERROR_LOG_ADDR; 
    for (int i = 0; i < error_count; i++) { 
        HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, addr, ((uint32_t)&error_buffer[i])); 
        addr += 4; 
        HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, addr, (((uint32_t)&error_buffer[i]) + 1)); 
        addr += 4; 
    }
    flash_lock();
}

uint8_t diagnostic_check(void) {
    uint8_t ok = 1; 
    if (!AS5600_Init()) { 
        log_error(ERR_AS5600_MISSING, 2, 0); 
        ok = 0; 
    }
    if (limit_x_left_triggered && limit_x_right_triggered) { 
        log_error(ERR_LIMIT_SWITCH_STUCK, 1, 0); 
        ok = 0; 
    }
    if (limit_y_front_triggered && limit_y_back_triggered) { 
        log_error(ERR_LIMIT_SWITCH_STUCK, 1, 1); 
        ok = 0; 
    }
    return ok;
}

