yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_controller.c
void HAL_GPIO_EXTI_Callback(uint16_t pin) {
    switch (pin) {
        case GPIO_PIN_1: clutch_endstop_triggered = 1; break;
        case GPIO_PIN_2: limit_x_left_triggered = 1; break;
        case GPIO_PIN_3: limit_x_right_triggered = 1; break;
        case GPIO_PIN_10: limit_y_front_triggered = 1; break;
        case GPIO_PIN_11: limit_y_back_triggered = 1; break;
        case GPIO_PIN_8: emergency_stop(); break; // Highest priority
        default: break;
    }
}

void safety_init(void) {
    GPIO_InitTypeDef g = {0}; 
    __HAL_RCC_GPIOA_CLK_ENABLE(); 
    g.Pin = GPIO_PIN_8; 
    g.Mode = GPIO_MODE_OUTPUT_PP; 
    g.Speed = GPIO_SPEED_FREQ_LOW; 
    HAL_GPIO_Init(GPIOA, &g);
    
    emergency_power_on(); 
    stepper_disable_x(); 
    stepper_disable_y(); 
    clutch_stop(); 
    calibrate_current_offsets(); 
    diagnostic_check();
}

/* ==========================================================================
 * PART 4: CAN COMMUNICATION, TASKS, POWER MANAGEMENT, ADVANCED LOGIC & MAIN
 * ========================================================================== */

/* --- CAN Communication and Shifting Tasks --- */

void HAL_CAN_RxFifo0MsgPendingCallback(CAN_HandleTypeDef* hcan) {
    CAN_RxHeaderTypeDef hdr;
    uint8_t data[8];
    
    if (HAL_CAN_GetRxMessage(hcan, CAN_RX_FIFO0, &hdr, data) == HAL_OK) {
        switch (hdr.StdId) {
            case 0x0C: engine_rpm = ((uint16_t)data[0] << 8) | data[1]; break;
            case 0x0D: vehicle_speed_kmh = data[0]; break;
            case 0x11: throttle_percent = data[0]; break;
            case 0x1A: brake_pressed = (data[0] > 0) ? 1 : 0; break;
            case 0x30: 
                shift_paddle_up = (data[0] & 0x01); 
                shift_paddle_down = (data[0] & 0x02); 
                break;
            default: break;
        }
        
        if (current_profile.front_speed_id && hdr.StdId == current_profile.front_speed_id) {
            uint16_t val = 0;
            for (int i = 0; i < current_profile.front_speed_length; i++) {
                val |= (data[current_profile.front_speed_offset + i] << (8 * i));
            }
            front_wheel_speed_raw = val;
        }
        if (current_profile.rear_speed_id && hdr.StdId == current_profile.rear_speed_id) {
            uint16_t val = 0;
            for (int i = 0; i < current_profile.rear_speed_length; i++) {
                val |= (data[current_profile.rear_speed_offset + i] << (8 * i));
            }
            rear_wheel_speed_raw = val;
        }
    }
}

void filter_data(void) {
    filtered_rpm = (uint16_t)((1.0f - FILTER_ALPHA) * filtered_rpm + FILTER_ALPHA * engine_rpm);
    filtered_throttle = (uint8_t)((1.0f - FILTER_ALPHA) * filtered_throttle + FILTER_ALPHA * throttle_percent);
}

void auto_shift_task(void) {
    if (limp_mode_active || shifting_in_progress || current_gear == 0 || current_gear == 6) return;
    
    static uint32_t last = 0;
    uint32_t now = HAL_GetTick();
    if (now - last < 800) return; // Debounce
    
    const ShiftMapEntry* e = &shift_map[SHIFT_MAP_SIZE - 1];
    for (int i = 0; i < SHIFT_MAP_SIZE; i++) {
        if (filtered_throttle <= shift_map[i].throttle) {
            e = &shift_map[i];
            break;
        }
    }
    
    if (filtered_rpm > e->upshift_rpm && current_gear < 5) {
        shift_gear_limp_safe(current_gear + 1);
        last = now;
    } else if (filtered_rpm < e->downshift_rpm && current_gear > 1) {
        shift_gear_limp_safe(current_gear - 1);
        last = now;
    }
    
    // Brake-initiated downshift
    if (brake_pressed && filtered_rpm < 2000 && current_gear > 1 && (now - last) > 500) {
        shift_gear_limp_safe(current_gear - 1);
        last = now;
    }
}

void manual_shift_task(void) {
    static uint32_t last = 0;
    uint32_t now = HAL_GetTick();
    if (now - last < 150) return;
    
    if (shift_paddle_up) {
        if (current_gear < 5) shift_gear_limp_safe(current_gear + 1);
        last = now;
        shift_paddle_up = 0;
    } else if (shift_paddle_down) {
        if (current_gear > 1) shift_gear_limp_safe(current_gear - 1);
        last = now;
        shift_paddle_down = 0;
    }
}

void toggle_drive_mode(void) {
    if (current_drive_mode == DRIVE_MODE_NORMAL) {
        current_drive_mode = DRIVE_MODE_COMFORT;
        uart_send_string(">>> AUTO (Comfort) <<<\r\n");
        led_set_pattern(2);
    } else {
        current_drive_mode = DRIVE_MODE_NORMAL;
        uart_send_string(">>> MANUAL (Normal) <<<\r\n");
        led_set_pattern(0);
    }
    activity_reset_timer();
}

void set_drive_mode_by_name(const char* s) {
    if (strcmp(s, "auto") == 0 || strcmp(s, "1") == 0) {
        current_drive_mode = DRIVE_MODE_COMFORT;
        uart_send_string(">>> AUTO (Comfort) ENABLED <<<\r\n");
        led_set_pattern(2);
    } else if (strcmp(s, "manual") == 0 || strcmp(s, "0") == 0) {
        current_drive_mode = DRIVE_MODE_NORMAL;
        uart_send_string(">>> MANUAL (Normal) ENABLED <<<\r\n");
        led_set_pattern(0);
    } else {
        uart_send_string("Invalid mode. Use 'auto' or 'manual'.\r\n");
    }
    activity_reset_timer();
}

/* --- Communication (Bluetooth & UART) --- */

void bt_send_string(char* s) {
    HAL_UART_Transmit(&huart3, (uint8_t*)s, strlen(s), HAL_MAX_DELAY);
}

void send_status_via_bt(void) {
    char b[UART_MSG_BUF_SIZE];
    const char* g = (current_gear == 0) ? "N" : (current_gear == 6) ? "R" : gear_names[current_gear];
    const char* m = (current_drive_mode != DRIVE_MODE_NORMAL) ? "AUTO" : "MANUAL";
    snprintf(b, sizeof(b), "Gear:%s RPM:%d Spd:%d Throt:%d%% Mode:%s Limp:%s\r\n", 
             g, filtered_rpm, get_speed_universal(), filtered_throttle, m, limp_mode_active ? "ON" : "OFF");
    bt_send_string(b);
}

void USART3_IRQHandler(void) {
    if (__HAL_UART_GET_FLAG(&huart3, UART_FLAG_RXNE)) {
        uint8_t ch = huart3.Instance->DR;
        if (ch == '\r' || ch == '\n') {
            if (bt_index > 0) {
                bt_buffer[bt_index] = '\0';
                bt_cmd_ready = 1;
            }
            bt_index = 0;
        } else {
            if (bt_index < BT_BUF_SIZE - 1) {
                bt_buffer[bt_index++] = (char)ch;
            } else {
                bt_index = 0;
            }
        }
        __HAL_UART_CLEAR_FLAG(&huart3, UART_FLAG_RXNE);
    }
}

void process_bt_command(void) {
    if (!bt_cmd_ready) return;
    activity_reset_timer();
    
    char c = bt_buffer[0];
    uint8_t can = cal_data.calibrated && !shifting_in_progress && !calibration_running;
    
    switch (c) {
        case '1': case '2': case '3': case '4': case '5':
            if (can) shift_gear_limp_safe(c - '0'); else bt_send_string("Shift blocked\r\n"); break;
        case 'N': case 'n':
            if (can) shift_gear_limp_safe(0); else bt_send_string("Shift blocked\r\n"); break;
        case 'R': case 'r':
            if (can && get_vehicle_speed() < 5 && current_gear == 0) shift_gear_limp_safe(6);
            else bt_send_string("Reverse only when stopped in N\r\n"); break;
        case 'A': case 'a':
            current_drive_mode = DRIVE_MODE_COMFORT; bt_send_string("Mode: AUTO\r\n"); led_set_pattern(2); break;
        case 'M': case 'm':
            current_drive_mode = DRIVE_MODE_NORMAL; bt_send_string("Mode: MANUAL\r\n"); led_set_pattern(0); break;
        case 'S': case 's':
            send_status_via_bt(); break;
        default:
            bt_send_string("Cmds: 1-5,N,R,A,M,S\r\n"); break;
    }
    bt_index = 0;
    bt_cmd_ready = 0;
    memset(bt_buffer, 0, BT_BUF_SIZE);
}

