yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_controller.c
void uart_command_handler(char* cmd) {
    activity_reset_timer();
    if (strcmp(cmd, "help") == 0) {
        uart_send_string("\r\n=== COMMANDS ===\r\nstatus calibrate learn_gears mode auto/manual gear N/1-5/R\r\ncan_scan can_status fault can clear fault save reset sensor_status\r\n================\r\n");
    } else if (strcmp(cmd, "status") == 0) {
        char b[UART_MSG_BUF_SIZE];
        uart_send_string("\r\n--- STATUS ---\r\n");
        snprintf(b, sizeof(b), "Mode:%s Gear:%s\r\n", (current_drive_mode != DRIVE_MODE_NORMAL) ? "AUTO" : "MANUAL", (current_gear == 0) ? "N" : (current_gear == 6) ? "R" : gear_names[current_gear]);
        uart_send_string(b);
        snprintf(b, sizeof(b), "RPM:%d Speed:%d Throttle:%d%%\r\n", filtered_rpm, get_speed_universal(), filtered_throttle);
        uart_send_string(b);
        snprintf(b, sizeof(b), "Clutch angle:%d (dis:%d bite:%d eng:%d)\r\n", clutch_get_current_angle(), cal_data.clutch_disengaged, cal_data.clutch_bite, cal_data.clutch_engaged);
        uart_send_string(b);
        snprintf(b, sizeof(b), "Sensor:%s Backup raw:%d\r\n", (active_sensor == PRIMARY_AS5600) ? "AS5600" : "POT", clutch_backup_sensor_raw);
        uart_send_string(b);
        snprintf(b, sizeof(b), "Calibrated:%s Limp:%s Sleep:%s\r\n", cal_data.calibrated ? "YES" : "NO", limp_mode_active ? "ACTIVE" : "OFF", system_sleeping ? "YES" : "NO");
        uart_send_string(b);
    } else if (strcmp(cmd, "calibrate") == 0) {
        if (calibration_running || shifting_in_progress) uart_send_string("Busy!\r\n");
        else { uart_send_string("Starting calibration...\r\n"); run_full_calibration(); }
    } else if (strcmp(cmd, "learn_gears") == 0) {
        if (calibration_running || shifting_in_progress || !cal_data.calibrated) uart_send_string("Complete basic calibration first!\r\n");
        else learn_gear_positions();
    } else if (strncmp(cmd, "mode ", 5) == 0) {
        set_drive_mode_by_name(cmd + 5);
    } else if (strncmp(cmd, "gear ", 5) == 0) {
        if (calibration_running || !cal_data.calibrated) { uart_send_string("Not calibrated!\r\n"); return; }
        char gc = cmd[5];
        uint8_t t = 0;
        if (gc == 'N' || gc == 'n' || gc == '0') t = 0;
        else if (gc >= '1' && gc <= '5') t = gc - '0';
        else if (gc == 'R' || gc == 'r' || gc == '6') {
            if (get_vehicle_speed() < 5 && current_gear == 0) t = 6;
            else { uart_send_string("Reverse only when stopped and in N\r\n"); return; }
        } else { uart_send_string("Invalid gear\r\n"); return; }
        if (!shift_gear_limp_safe(t)) uart_send_string("Shift blocked\r\n");
    } else if (strcmp(cmd, "can_scan") == 0) {
        can_profile_valid = 0;
        if (auto_scan_can()) apply_vehicle_adaptation();
    } else if (strcmp(cmd, "can_status") == 0) {
        char b[UART_MSG_BUF_SIZE];
        snprintf(b, sizeof(b), "CAN valid:%s RPM_ID:0x%X SPD_ID:0x%X\r\n", can_profile_valid ? "YES" : "NO", current_profile.rpm_id, current_profile.speed_id);
        uart_send_string(b);
    } else if (strcmp(cmd, "fault can") == 0) {
        enter_limp_mode("SIMULATED CAN LOSS");
    } else if (strcmp(cmd, "clear fault") == 0) {
        exit_limp_mode();
    } else if (strcmp(cmd, "save") == 0) {
        cal_data.crc = 0;
        cal_data.crc = calculate_crc16((uint8_t*)&cal_data, sizeof(CalibrationData));
        if (flash_save_calibration(&cal_data)) uart_send_string("Saved to Flash.\r\n");
        else uart_send_string("Flash write failed.\r\n");
    } else if (strcmp(cmd, "sensor_status") == 0) {
        char b[UART_MSG_BUF_SIZE];
        snprintf(b, sizeof(b), "Active:%s AS5600:%d Backup raw:%d Mapped:%d\r\n", (active_sensor == PRIMARY_AS5600) ? "AS5600" : "POT", AS5600_ReadAngle(), clutch_backup_sensor_raw, backup_to_as5600_angle(clutch_backup_sensor_raw));
        uart_send_string(b);
    } else if (strcmp(cmd, "reset") == 0) {
        uart_send_string("Resetting...\r\n");
        HAL_Delay(500);
        NVIC_SystemReset();
    } else {
        uart_send_string("Unknown. Type 'help'.\r\n");
    }
}

/* --- Power Management --- */

void power_clutch_on(void) { clutch_stop(); }
void power_clutch_off(void) { clutch_stop(); }

static void power_actuators_on(void) {
    stepper_enable_x();
    stepper_enable_y();
    power_clutch_on();
}

static void power_actuators_off(void) {
    power_clutch_off();
    // Steppers stay enabled to hold gear position against return springs
}

void activity_reset_timer(void) {
    if (system_sleeping) {
        system_sleeping = 0;
        power_actuators_on();
        uart_send_string("[INFO] Woke up.\r\n");
    }
    last_activity_time = HAL_GetTick();
}

static void system_enter_sleep(void) {
    if (shifting_in_progress || calibration_running || limp_mode_active) return;
    if (system_sleeping) return;
    power_actuators_off();
    system_sleeping = 1;
    led_set_pattern(4);
    HAL_SuspendTick();
    HAL_PWR_EnterSLEEPMode(PWR_MAINREGULATOR_ON, PWR_SLEEPENTRY_WFI);
    HAL_ResumeTick();
    uart_send_string("[INFO] Sleep mode.\r\n");
}

void idle_monitor_task(void) {
    static uint32_t last = 0;
    uint32_t now = HAL_GetTick();
    if (now - last < 1000) return;
    last = now;
    if (!system_sleeping && !shifting_in_progress && !calibration_running && (now - last_activity_time) >= IDLE_TIMEOUT_MS) {
        system_enter_sleep();
    }
}

/* --- Advanced Vehicle Logic (CAN Profiling, AWD, Parking, Limp) --- */

uint16_t get_rpm_universal(void) {
    if (can_profile_valid && current_profile.rpm_id != 0) return filtered_rpm;
    read_analog_tacho();
    return engine_rpm_analog;
}

uint8_t get_speed_universal(void) {
    return (can_profile_valid && current_profile.speed_id != 0) ? vehicle_speed_kmh : 0;
}

uint8_t auto_scan_can(void) {
    uart_send_string("Scanning CAN (4 sec)...\r\n");
    typedef struct { uint16_t id; uint8_t cnt; } Seen;
    Seen seen[64];
    uint8_t seen_cnt = 0;
    uint32_t start = HAL_GetTick();
    
