yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_controller.c
    while (HAL_GetTick() - start < 4000) {
        if (HAL_CAN_GetRxFifoFillLevel(&hcan1, CAN_RX_FIFO0) > 0) {
            CAN_RxHeaderTypeDef hdr;
            uint8_t d[8];
            if (HAL_CAN_GetRxMessage(&hcan1, CAN_RX_FIFO0, &hdr, d) == HAL_OK) {
                uint8_t found = 0;
                for (int i = 0; i < seen_cnt; i++) {
                    if (seen[i].id == hdr.StdId) { seen[i].cnt++; found = 1; break; }
                }
                if (!found && seen_cnt < 64) {
                    seen[seen_cnt].id = hdr.StdId;
                    seen[seen_cnt].cnt = 1;
                    seen_cnt++;
                }
            }
        }
        IWDG_Refresh();
        HAL_Delay(5);
    }
    
    int best_score = 0, best_idx = -1;
    for (int p = 0; p < NUM_PROFILES; p++) {
        int score = 0;
        for (int i = 0; i < seen_cnt; i++) {
            if (seen[i].cnt < 2) continue;
            if (seen[i].id == known_profiles[p].rpm_id) score += 3;
            if (seen[i].id == known_profiles[p].speed_id) score += 3;
            if (seen[i].id == known_profiles[p].throttle_id) score += 1;
            if (seen[i].id == known_profiles[p].brake_id) score += 1;
        }
        if (score > best_score) { best_score = score; best_idx = p; }
    }
    
    if (best_score >= 5 && best_idx >= 0) {
        current_profile = known_profiles[best_idx];
        can_profile_valid = 1;
        save_can_profile();
        uart_send_string("Profile matched.\r\n");
        return 1;
    }
    uart_send_string("No match. Using analog fallback.\r\n");
    return 0;
}

void save_can_profile(void) {
    flash_unlock();
    flash_erase_page(CAN_PROFILE_FLASH_ADDR);
    uint32_t* src = (uint32_t*)&current_profile;
    uint32_t words = sizeof(CanProfile) / 4;
    uint32_t addr = CAN_PROFILE_FLASH_ADDR;
    for (uint32_t i = 0; i < words; i++) {
        HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, addr, src[i]);
        addr += 4;
    }
    flash_lock();
}

void load_can_profile(void) {
    CanProfile* fp = (CanProfile*)CAN_PROFILE_FLASH_ADDR;
    if (fp->rpm_id != 0) {
        memcpy(&current_profile, fp, sizeof(CanProfile));
        can_profile_valid = 1;
        uart_send_string("CAN profile loaded.\r\n");
    } else {
        uart_send_string("No profile. Scanning...\r\n");
        auto_scan_can();
    }
}

void apply_vehicle_adaptation(void) {
    if (!can_profile_valid) return;
    uart_send_string("Applying adaptations...\r\n");
    if (current_profile.rpm_id == 0x0C) uart_send_string("Ford profile.\r\n");
    else if (current_profile.rpm_id == 0x280) uart_send_string("VAG profile.\r\n");
}

DriveParameters get_current_drive_params(void) { return params_table[current_drive_mode]; }

void set_drive_mode(DriveMode m) {
    if (m == current_drive_mode || shifting_in_progress) return;
    current_drive_mode = m;
    const char* n[] = { "COMFORT", "NORMAL", "SPORT", "WINTER" };
    char msg[64];
    snprintf(msg, sizeof(msg), ">>> DRIVE MODE: %s <<<\r\n", n[m]);
    uart_send_string(msg);
    bt_send_string(msg);
    activity_reset_timer();
}

uint8_t get_start_gear(void) { return get_current_drive_params().start_from_second ? 2 : 1; }

void start_moving(void) {
    activity_reset_timer();
    uint8_t t = get_start_gear();
    if (current_gear != 0) shift_gear_limp_safe(0);
    HAL_Delay(100);
    if (get_speed_universal() < 5) shift_gear_limp_safe(t);
    else uart_send_string("Start blocked: speed high.\r\n");
}

void check_critical_failures(void) {
    if (limp_mode_active) return;
    uint16_t r = get_rpm_universal();
    uint8_t s = get_speed_universal();
    if (r == 0 && s > 5) {
        if (can_loss_timer == 0) can_loss_timer = HAL_GetTick();
        else if ((HAL_GetTick() - can_loss_timer) > 2000) enter_limp_mode("CAN BUS LOST");
    } else {
        can_loss_timer = 0;
    }
    if (active_sensor == SENSOR_FAULT) enter_limp_mode("CLUTCH SENSOR FAULT");
}

void enter_limp_mode(const char* reason) {
    limp_mode_active = 1;
    current_drive_mode = DRIVE_MODE_NORMAL;
    char m[128];
    snprintf(m, sizeof(m), "LIMP MODE! Reason: %s\r\nUse N or 2nd gear.\r\n", reason);
    bt_send_string(m);
    uart_send_string(m);
    log_error(ERR_WATCHDOG_RESET, 2, 99);
    led_set_pattern(3);
}

void exit_limp_mode(void) {
    if (!limp_mode_active) return;
    if (active_sensor != SENSOR_FAULT && get_rpm_universal() > 0) {
        limp_mode_active = 0;
        can_loss_timer = 0;
        uart_send_string("Limp mode cleared.\r\n");
        bt_send_string("Limp mode cleared.\r\n");
        led_set_pattern(current_drive_mode != DRIVE_MODE_NORMAL ? 2 : 0);
    } else {
        uart_send_string("Fault still present.\r\n");
    }
}

void execute_parking_mode(void) {
    if (is_parked || get_speed_universal() > 2) return;
    uart_send_string(">>> PARKING MODE <<<\r\n");
    activity_reset_timer();
    if (current_gear == 0) {
        shift_gear_limp_safe(1);
        HAL_Delay(500);
    }
    clutch_control_advanced(CLUTCH_ENGAGE);
    is_parked = 1;
    uart_send_string("!!! Car in gear. APPLY HANDBRAKE !!!\r\n");
    bt_send_string("PARKED. Apply handbrake!\r\n");
    led_set_pattern(4);
}

void exit_parking_mode(void) {
    if (!is_parked) return;
    uart_send_string(">>> EXIT PARKING <<<\r\n");
    activity_reset_timer();
    if (current_gear != 0) {
        shift_gear_limp_safe(0);
        HAL_Delay(500);
    }
    is_parked = 0;
    uart_send_string("Ready.\r\n");
    bt_send_string("Unparked.\r\n");
    led_set_pattern(current_drive_mode != DRIVE_MODE_NORMAL ? 2 : 0);
}

void parking_monitor_task(void) {
    uint16_t rpm = get_rpm_universal();
    if (rpm < 100) {
        if (engine_off_timer == 0) engine_off_timer = HAL_GetTick();
        else if ((HAL_GetTick() - engine_off_timer) > 3000 && !shifting_in_progress) {
            execute_parking_mode();
        }
    } else {
        engine_off_timer = 0;
        if (is_parked && rpm > 500) exit_parking_mode();
    }
}

void awd_init(void) {
    GPIO_InitTypeDef g = {0};
    __HAL_RCC_GPIOB_CLK_ENABLE();
    g.Pin = awd_config.awd_enable_pin;
    g.Mode = GPIO_MODE_OUTPUT_PP;
    g.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOB, &g);
    HAL_GPIO_WritePin(GPIOB, awd_config.awd_enable_pin, GPIO_PIN_RESET);
    awd_engaged = 0;
}

void awd_set_engaged(uint8_t en) {
    if (en == awd_engaged) return;
    if (en) {
        HAL_GPIO_WritePin(GPIOB, awd_config.awd_enable_pin, GPIO_PIN_SET);
        HAL_Delay(awd_config.awd_engage_delay_ms);
        awd_engaged = 1;
        awd_engagement_time = HAL_GetTick();
        uart_send_string("[AWD] Engaged\r\n");
    } else {
        HAL_GPIO_WritePin(GPIOB, awd_config.awd_enable_pin, GPIO_PIN_RESET);
        awd_engaged = 0;
        uart_send_string("[AWD] Disengaged\r\n");
    }
}

uint8_t get_wheel_speed_diff(void) {
    uint8_t front = front_wheel_speed_raw / 10;
    uint8_t rear = rear_wheel_speed_raw / 10;
    return (front > rear) ? (front - rear) : (rear - front);
}

