yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_controller.c
void awd_auto_task(void) {
    static uint32_t last = 0;
    uint32_t now = HAL_GetTick();
    if (now - last < 100) return;
    last = now;
    
    uint8_t diff = get_wheel_speed_diff();
    uint8_t spd = get_speed_universal();
    
    switch (current_awd_mode) {
        case AWD_MODE_2WD:
            if (awd_engaged) awd_set_engaged(0);
            break;
        case AWD_MODE_AUTO:
            if (diff >= awd_config.awd_auto_speed_diff) {
                if (!awd_engaged) awd_set_engaged(1);
            } else if (awd_engaged && spd > 15) {
                awd_set_engaged(0);
            }
            break;
        case AWD_MODE_LOCK:
            if (!awd_engaged) awd_set_engaged(1);
            if (awd_config.awd_lock_timeout_s > 0 && (now - awd_engagement_time) > (awd_config.awd_lock_timeout_s * 1000)) {
                uart_send_string("[AWD] LOCK timeout -> AUTO\r\n");
                current_awd_mode = AWD_MODE_AUTO;
                awd_set_engaged(0);
            }
            break;
        case AWD_MODE_LOW:
            if (!awd_engaged) awd_set_engaged(1);
            if (spd > 40) {
                uart_send_string("[AWD] Speed high for LOW\r\n");
                current_awd_mode = AWD_MODE_AUTO;
            }
            break;
    }
}

void awd_set_mode(AwdMode m) {
    if (m == current_awd_mode) return;
    if ((m == AWD_MODE_LOCK || m == AWD_MODE_LOW) && get_speed_universal() > 30) {
        uart_send_string("AWD blocked: speed high\r\n");
        return;
    }
    current_awd_mode = m;
    const char* n[] = { "2WD", "AUTO", "LOCK", "LOW" };
    char msg[64];
    snprintf(msg, sizeof(msg), ">>> AWD: %s <<<\r\n", n[m]);
    uart_send_string(msg);
    bt_send_string(msg);
}

/* --- Analog Tachometer Callbacks --- */

void TIM4_IRQHandler(void) {
    HAL_TIM_IRQHandler(&htim4);
}

void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef* htim) {
    if (htim->Instance == TIM4) {
        uint32_t now = HAL_TIM_ReadCapturedValue(htim, TIM_CHANNEL_1);
        if (tacho_last_capture != 0) {
            uint32_t diff = now - tacho_last_capture;
            if (now < tacho_last_capture) {
                diff = (0xFFFF - tacho_last_capture) + now; // Handle overflow
            }
            if (diff < 60000) { // Filter noise (>1000 RPM)
                tacho_period_us = diff;
            }
        }
        tacho_last_capture = now;
    }
}

void read_analog_tacho(void) {
    #define TACHO_PULSES_PER_REV 2
    if (tacho_period_us > 0) {
        float freq = 1000000.0f / (float)tacho_period_us;
        engine_rpm_analog = (uint16_t)((freq / TACHO_PULSES_PER_REV) * 60.0f + 0.5f);
    } else {
        engine_rpm_analog = 0;
    }
}

/* --- Redundant Clutch Sensor (Final Bits) --- */

uint16_t clutch_get_current_angle(void) {
    if (active_sensor == PRIMARY_AS5600) {
        uint16_t a = AS5600_ReadAngle();
        if (!as5600_comm_ok) {
            active_sensor = BACKUP_POTENTIOMETER;
            log_error(ERR_AS5600_MISSING, 1, 0);
        }
        return a;
    } else if (active_sensor == BACKUP_POTENTIOMETER) {
        return backup_to_as5600_angle(clutch_backup_sensor_raw);
    }
    return 0xFFFF;
}

void check_sensor_consistency(void) {
    if (!backup_cal.calibrated) return;
    uint16_t prim = AS5600_ReadAngle();
    uint16_t back = backup_to_as5600_angle(clutch_backup_sensor_raw);
    int16_t diff = (int16_t)prim - (int16_t)back;
    if (diff < 0) diff = -diff;
    
    if (diff > SENSOR_TOLERANCE) {
        if (active_sensor == PRIMARY_AS5600 && !as5600_fault) {
            as5600_fault = 1;
            active_sensor = BACKUP_POTENTIOMETER;
            log_error(ERR_AS5600_MISSING, 1, diff);
            uart_send_string("Sensor mismatch! Using backup.\r\n");
            bt_send_string("AS5600 FAULT - Backup active\r\n");
        }
    } else {
        if (as5600_fault && active_sensor == BACKUP_POTENTIOMETER) {
            static uint8_t stable = 0;
            if (diff < (SENSOR_TOLERANCE / 2)) {
                if (++stable >= 5) {
                    as5600_fault = 0;
                    active_sensor = PRIMARY_AS5600;
                    stable = 0;
                    uart_send_string("AS5600 recovered.\r\n");
                }
            } else {
                stable = 0;
            }
        }
    }
}

/* --- Main Loop and Main Function --- */

void main_loop(void) {
    static uint32_t t100 = 0, t500 = 0, t1000 = 0;
    uint32_t now = HAL_GetTick();
    
    if (now - t100 >= 100) {
        t100 = now;
        filter_data();
        current_monitor_task();
        check_critical_failures();
        parking_monitor_task();
        awd_auto_task();
        if (cal_data.calibrated && !calibration_running) {
            if (current_drive_mode != DRIVE_MODE_NORMAL) {
                auto_shift_task();
            } else {
                manual_shift_task();
            }
        }
        process_bt_command();
    }
    
    if (now - t500 >= 500) {
        t500 = now;
        IWDG_Refresh(); // CRITICAL: Keep watchdog alive
        if (cal_data.calibrated && !calibration_running) {
            diagnostic_check();
            read_clutch_backup_sensor();
            check_sensor_consistency();
        }
    }
    
    if (now - t1000 >= 1000) {
        t1000 = now;
        idle_monitor_task();
        if (!calibration_running && !shifting_in_progress) {
            if (!cal_data.calibrated) led_set_pattern(1);
            else if (system_sleeping) led_set_pattern(4);
            else if (current_drive_mode != DRIVE_MODE_NORMAL) led_set_pattern(2);
            else led_set_pattern(0);
        }
    }
    
    if (uart_cmd_ready) {
        uart_command_handler(uart_rx_buf);
        uart_clear_buffer();
    }
}

int main(void) {
    HAL_Init();
    SystemClock_Config();
    
    // Initialize all peripherals
    MX_GPIO_Init();
    MX_I2C1_Init();
    MX_SPI2_Init();
    MX_USART1_UART_Init();
    MX_USART3_UART_Init();
    MX_CAN1_Init();
    MX_ADC1_Init();
    MX_TIM2_Init();
    MX_TIM4_Init();
    
