yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_controller.c
    // CRITICAL FIX: Initialize watchdog timer
    IWDG_Init();
    
    HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
    DWT_Init();
    safety_init();
    awd_init();
    
    // Startup LED blink (3 times)
    for (int i = 0; i < 3; i++) {
        HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_13);
        HAL_Delay(100);
    }
    
    uart_send_string("\r\n=== ROBOTIZED GEARBOX v4.0 FINAL (Competition Edition) ===\r\n");
    uart_send_string("Author: Mykola Yushchenko, KPCAD\r\n");
    uart_send_string("License: GPL-3.0 Open Source\r\n\r\n");
    
    load_can_profile();
    apply_vehicle_adaptation();
    
    if (flash_load_calibration(&cal_data)) {
        uart_send_string("Calibration loaded from Flash.\r\n");
        led_set_pattern(cal_data.calibrated ? (current_drive_mode != DRIVE_MODE_NORMAL ? 2 : 0) : 1);
    } else {
        uart_send_string("No calibration found. Auto-calibration in 5 seconds...\r\n");
        uart_send_string("Press any key to cancel.\r\n");
        auto_calib_timer = HAL_GetTick() + 5000;
    }
    
    // Main infinite loop
    while (1) {
        if (auto_calib_timer && HAL_GetTick() >= auto_calib_timer) {
            if (!uart_cmd_ready) {
                auto_calib_timer = 0;
                run_full_calibration();
            } else {
                uart_send_string("Auto-calibration cancelled by user.\r\n");
                auto_calib_timer = 0;
                uart_clear_buffer();
            }
        }
        
        main_loop();
        HAL_Delay(1);
    }
}

/* ==================== END OF FILE ==================== */
